Retuze/nrf54l15/boards/xiao_nrf54l15/board.c
/* ---- Shell instance (RTT-backed) --------------------------------------- */

static shell_t g_shell;

static void shell_rtt_output(const void *buf, size_t len)
{
    rtt_write((const char *)buf, (uint32_t)len);
}

shell_t *board_shell_get(void)
{
    return &g_shell;
}

bool board_shell_poll(void)
{
    char buf[256];
    uint32_t n = rtt_read(buf, sizeof(buf));
    for (uint32_t i = 0; i < n; i++)
        ringbuf_put(&g_shell.rb, (uint8_t)buf[i]);

    return shell_poll(&g_shell);
}

/* ---- tick_ms adapter (SysTick via rt_tick_get, 1ms resolution) -------- */

static uint32_t board_tick_ms(void *ctx)
{
    (void)ctx;
    return rt_tick_get();
}


void rt_hw_console_output(const char *str)
{
    extern int write(int fd, const void *buf, unsigned int len);
    (void)write(1, str, (unsigned int)rt_strlen(str));
}

/* ---- 前向声明 --------------------------------------------------------- */
void board_i2s_playback_start(bool loop);

/* ---- Init ------------------------------------------------------------- */
static rt_uint8_t g_rt_heap[RT_HEAP_SIZE] ALIGN(RT_ALIGN_SIZE);

void SysTick_Handler(void)
{
    rt_interrupt_enter();
    rt_tick_increase();
    rt_interrupt_leave();
}

void rt_hw_board_init(void)
{
    board_init();
    rt_system_heap_init(g_rt_heap, g_rt_heap + sizeof(g_rt_heap));

    SystemCoreClockUpdate();
    SysTick_Config(SystemCoreClock / RT_TICK_PER_SECOND);
}

/*
 * GRTC initialization is deferred to Phase 2 MPSL/SDC init.
 * SysTick (rt_tick_get) provides the tick_ms baseline for Phase 1.
 */
void board_init(void)
{
    nrfx_power_config_t pwr_cfg = { .dcdcen = true };
    nrfx_power_init(&pwr_cfg);

    rtt_init();
    shell_init(&g_shell, shell_rtt_output);
    serialBegin(115200);
    {
        static const char boot_msg[] = "XIAO nRF54L15 UART ready\r\n";
        serialWrite((const uint8_t *)boot_msg, sizeof(boot_msg) - 1u);
    }

    /* ---- Onboard LED ------------------------------------------------- */
    pinMode(LED_PIN, OUTPUT);

    led_indicator_cfg_t led_cfg = {
        .set_on  = board_led_set_on,
        .set_pwm = board_led_set_pwm,
        .tick_ms = board_tick_ms,
        .ctx     = NULL,
    };
    led_indicator_init(&s_board_led, &led_cfg);

    /* ---- Onboard KEY ------------------------------------------------- */
#if KEY_ACTIVE_LOW
    pinMode(KEY_PIN, INPUT_PULLUP);
#else
    pinMode(KEY_PIN, INPUT_PULLDOWN);
#endif

    /* ---- RF antenna switch -------------------------------------------- */
    /*
     * XIAO nRF54L15 RF antenna switch:
     *   P2.03 = RF switch power → HIGH powers the SP3T switch
     *   P2.05 = RF switch select → LOW = PCB antenna, HIGH = IPEX/u.FL
     */
    pinMode(PIN_P2(3), OUTPUT);
    digitalWrite(PIN_P2(3), HIGH);
    pinMode(PIN_P2(5), OUTPUT);
    digitalWrite(PIN_P2(5), LOW);

    /* ---- Button instance ---------------------------------------------- */
    button_cfg_t btn_cfg = {
        .read_pressed = board_button_read_pressed,
        .tick_ms      = board_tick_ms,
        .ctx          = NULL,
    };
    button_init(&s_board_btn, &btn_cfg);

    /* ---- SD card ---------------------------------------------------- */
    board_sd_init();

    /* Audio playback (I2S PCM / Opus) deferred to app_init() —
     * the RT-Thread priority table isn't ready yet. */
}

/* ---- I2S 回环测试 (Full-Duplex TX+RX) ---------------------------------- */

/*
 * I2S 配置 (Master, Full-Duplex):
 *   格式: I2S, 16-bit, left-aligned, left channel
 *   MCK:  4 MHz   (32MDIV8)
 *   LRCK: 4 MHz / 256 = 15.625 kHz (≈16 kHz 采样率)
 *   SCK:  LRCK × 32 = 500 kHz
 *
 * 引脚:
 *   D0 / P1.04 → SCK
 *   D1 / P1.05 → LRCK
 *   D2 / P1.06 → SDOUT  (TX)
 *   D3 / P1.07 → MCK
 *   D4 / P1.10 → SDIN   (RX) ← 用杜邦线连接 D2(SDOUT) → D4(SDIN)
 *
 * DMA 双缓冲 ping-pong, 每缓冲 256 samples.
 * 每完成一次传输比对 TX/RX 数据, 累计误码并周期打印.
 */
#define I2S_SINE_TABLE_SIZE 256u
#define I2S_BUF_WORDS       I2S_SINE_TABLE_SIZE
#define I2S_LOG_INTERVAL    64u  /* 每 64 次回调打印一次统计 */
#define I2S_DBG_DUMP_COUNT   1u   /* 前 N 次回调打印 TX/RX hex dump */

static nrfx_i2s_t  g_i2s = NRFX_I2S_INSTANCE(20);
static int16_t     g_sine_table[I2S_SINE_TABLE_SIZE];

/* TX 双缓冲 */
static uint32_t g_i2s_tx_a[I2S_BUF_WORDS] __attribute__((aligned(4)));
static uint32_t g_i2s_tx_b[I2S_BUF_WORDS] __attribute__((aligned(4)));
/* RX 双缓冲 */
static uint32_t g_i2s_rx_a[I2S_BUF_WORDS] __attribute__((aligned(4)));
static uint32_t g_i2s_rx_b[I2S_BUF_WORDS] __attribute__((aligned(4)));

static volatile bool g_i2s_running;

/* PCM 播放状态 */
static uint32_t g_playback_pos;   /* 当前 PCM 数据位置 (word 索引) */
static bool     g_playback_loop;  /* 循环播放 */

/* 麦克风数据缓冲 (Ring buffer, 16-bit 单声道) */
#define MIC_BUF_SAMPLES  (I2S_BUF_WORDS * 4)  /* 4 帧 = ~65ms */
static int16_t  g_mic_buf[MIC_BUF_SAMPLES];
static volatile uint32_t g_mic_write;  /* 写入位置 (ISR 更新) */
static volatile uint32_t g_mic_read;   /* 读取位置 (线程更新) */

/* 回环统计 */
static volatile uint32_t g_i2s_cb_count;    /* 回调计数 */
static volatile uint32_t g_i2s_mismatches;  /* 累计误码 word 数 */
static volatile uint32_t g_i2s_total_words; /* 累计传输 word 数 */

static void i2s_fill_buffer(uint32_t *buf)
{
    for (uint16_t i = 0; i < I2S_BUF_WORDS; i++) {
        buf[i] = ((uint32_t)(uint16_t)g_sine_table[i]) << 16;
    }
}

static void i2s_data_handler(nrfx_i2s_buffers_t const *p_released,
                             uint32_t                   status)
{
    if (status & NRFX_I2S_STATUS_TRANSFER_STOPPED) {
        g_i2s_running = false;
        return;
    }

    /* 比对刚完成的 TX/RX 数据
     * I2S Full-Duplex 有 1 frame 固有延迟: TX[N] → RX[N+1].
     * 比对 TX[0..N-2] ↔ RX[1..N-1], 忽略 RX[0] (初值 0) 和 TX[N-1] (无对应 RX). */
    if (p_released && p_released->p_tx_buffer && p_released->p_rx_buffer) {
        #define I2S_CMP_COUNT (I2S_BUF_WORDS - 1)
        uint32_t local_mismatch = 0;
        for (uint16_t i = 0; i < I2S_CMP_COUNT; i++) {
            if (p_released->p_tx_buffer[i] != p_released->p_rx_buffer[i + 1]) {
                local_mismatch++;
            }
        }
        g_i2s_mismatches += local_mismatch;
        g_i2s_total_words += I2S_CMP_COUNT;
        g_i2s_cb_count++;

        /* 首次传输完成: 打印 TX/RX 前 20 words 的 hex dump，便于诊断 */
        if (g_i2s_cb_count <= I2S_DBG_DUMP_COUNT) {
            rt_kprintf("I2S cb#%u: TX[0..19] =",
                       (unsigned)g_i2s_cb_count);
            for (uint8_t j = 0; j < 20; j++) {
                rt_kprintf(" %08lX", p_released->p_tx_buffer[j]);
            }
            rt_kprintf("\n             RX[0..19] =");
            for (uint8_t j = 0; j < 20; j++) {
                rt_kprintf(" %08lX", p_released->p_rx_buffer[j]);
            }
            rt_kprintf("\n             mismatches=%u/%u (offset=1)\n",
                       (unsigned)local_mismatch, (unsigned)I2S_CMP_COUNT);
        }

        if ((g_i2s_cb_count % I2S_LOG_INTERVAL) == 0) {
            uint32_t ber_milli = g_i2s_total_words
                ? (uint32_t)((uint64_t)g_i2s_mismatches * 100000 / g_i2s_total_words)
                : 0;
            rt_kprintf("I2S loopback: %u/%u words BER=%u.%03u%%\n",
                       (unsigned)g_i2s_mismatches,
                       (unsigned)g_i2s_total_words,
                       (unsigned)(ber_milli / 1000),
                       (unsigned)(ber_milli % 1000));
        }
    } else if (!p_released) {
        g_i2s_cb_count++;
    }

    /* 乒乓切换: 将刚释放的 buffer 重新提交 */
    const uint32_t *next_tx;
    uint32_t       *next_rx;

