Retuze/nrf54l15/boards/xiao_nrf54l15/board.c
    if (p_released && p_released->p_tx_buffer) {
        next_tx = p_released->p_tx_buffer;
        next_rx = (p_released->p_tx_buffer == g_i2s_tx_a)
                  ? g_i2s_rx_a : g_i2s_rx_b;
    } else {
        /* 首次回调: 提交 B 组 buffer */
        next_tx = g_i2s_tx_b;
        next_rx = g_i2s_rx_b;
    }

    nrfx_i2s_buffers_t next = {
        .p_tx_buffer = next_tx,
        .p_rx_buffer = next_rx,
        .buffer_size = I2S_BUF_WORDS,
    };
    nrfx_i2s_next_buffers_set(&g_i2s, &next);
}

void board_i2s_loopback_start(void)
{
    if (g_i2s_running) return;

    /* 生成正弦查找表 (16-bit signed, full swing) */
    for (uint16_t i = 0; i < I2S_SINE_TABLE_SIZE; i++) {
        double phase = 2.0 * 3.141592653589793 * (double)i / (double)I2S_SINE_TABLE_SIZE;
        g_sine_table[i] = (int16_t)(sin(phase) * 32767.0);
    }

    /* 预填充 TX 双缓冲, RX 缓冲清零 */
    i2s_fill_buffer(g_i2s_tx_a);
    i2s_fill_buffer(g_i2s_tx_b);
    for (uint16_t i = 0; i < I2S_BUF_WORDS; i++) {
        g_i2s_rx_a[i] = 0;
        g_i2s_rx_b[i] = 0;
    }

    nrfx_i2s_config_t cfg = NRFX_I2S_DEFAULT_CONFIG(
        I2S_SCK_PIN,
        I2S_LRCK_PIN,
        I2S_MCK_PIN,
        I2S_SDOUT_PIN,
        I2S_SDIN_PIN
    );
    cfg.sample_width = NRF_I2S_SWIDTH_16BIT;
    cfg.alignment    = NRF_I2S_ALIGN_LEFT;
    cfg.channels     = NRF_I2S_CHANNELS_LEFT;
    cfg.mck_setup    = NRF_I2S_MCK_32MDIV8;
    cfg.ratio        = NRF_I2S_RATIO_256X;
    cfg.irq_priority = 6;

    nrfx_err_t err = nrfx_i2s_init(&g_i2s, &cfg, i2s_data_handler);
    if (err != NRFX_SUCCESS) {
        rt_kprintf("I2S loopback init failed: %u\n", (unsigned)err);
        return;
    }

    g_i2s_cb_count    = 0;
    g_i2s_mismatches  = 0;
    g_i2s_total_words = 0;

    nrfx_i2s_buffers_t initial = {
        .p_tx_buffer = g_i2s_tx_a,
        .p_rx_buffer = g_i2s_rx_a,
        .buffer_size = I2S_BUF_WORDS,
    };
    err = nrfx_i2s_start(&g_i2s, &initial, 0);
    if (err != NRFX_SUCCESS) {
        rt_kprintf("I2S loopback start failed: %u\n", (unsigned)err);
        return;
    }

    g_i2s_running = true;
    rt_kprintf("I2S loopback started: LRCK=15.625kHz Full-Duplex\n");
    rt_kprintf("  Connect D2(SDOUT) -> D4(SDIN) with a jumper wire\n");
    rt_kprintf("  SCK=D0 LRCK=D1 SDOUT=D2 MCK=D3 SDIN=D4\n");
}

void board_i2s_stop(void)
{
    if (!g_i2s_running) return;
    nrfx_i2s_stop(&g_i2s);
    g_i2s_running = false;
    rt_kprintf("I2S stopped: total %u words, %u mismatches\n",
               (unsigned)g_i2s_total_words, (unsigned)g_i2s_mismatches);
}

/* ---- SD 卡初始化 ------------------------------------------------------- */

void board_sd_init(void)
{
    sd_err_t err = sd_init();
    if (err == SD_OK) {
        sd_get_info();
    } else {
        rt_kprintf("SD: init failed (err=%d) — check wiring D6=SCK D7=MOSI D8=MISO D9=CS\n",
                   (int)err);
    }
}

/* ---- Opus 音频播放 (I2S TX-only, D2/SDOUT) ----------------------------- */

void board_opus_play_start(void)
{
    opus_player_start();
}

void board_opus_play_stop(void)
{
    opus_player_stop();
}

void board_opus_loopback_start(void)
{
    opus_loopback_start();
}

/* ---- I2S PCM 播放 (TX-only, 从 Flash 流式输出) -------------------------- */

/* 将 uint16_t PCM 样本展开为 I2S 32-bit 字 (STEREO: 左右声道相同) */
static inline void pcm_expand(uint32_t *dst, const uint16_t *src, uint32_t n)
{
    for (uint32_t i = 0; i < n; i++) {
        uint32_t s = src[i];
        dst[i] = (s << 16) | s;
    }
}

/* 从 I2S 32-bit 字提取左声道 int16_t 样本 */
static inline void mic_extract(int16_t *dst, const uint32_t *src, uint32_t n)
{
    for (uint32_t i = 0; i < n; i++) {
        dst[i] = (int16_t)(src[i] >> 16);  /* 高 16 位 = 左声道 */
    }
}

static void i2s_playback_data_handler(nrfx_i2s_buffers_t const *p_released,
                                      uint32_t                   status)
{
    if (status & NRFX_I2S_STATUS_TRANSFER_STOPPED) {
        g_i2s_running = false;
        return;
    }

    uint32_t *next_tx;
    uint32_t *next_rx;
    if (p_released && p_released->p_tx_buffer) {
        next_tx = (p_released->p_tx_buffer == g_i2s_tx_a) ? g_i2s_tx_a : g_i2s_tx_b;
        next_rx = (p_released->p_tx_buffer == g_i2s_tx_a) ? g_i2s_rx_a : g_i2s_rx_b;

        /* 保存刚收到的麦克风数据到 ring buffer */
        uint32_t w = g_mic_write;
        mic_extract(&g_mic_buf[w], next_rx, I2S_BUF_WORDS);
        w += I2S_BUF_WORDS;
        if (w >= MIC_BUF_SAMPLES) w = 0;
        g_mic_write = w;
    } else {
        next_tx = g_i2s_tx_b;
        next_rx = g_i2s_rx_b;
    }

    /* 填充下一帧 TX 数据 */
    uint32_t remaining = PCM_NUM_SAMPLES - g_playback_pos;
    uint32_t to_copy   = remaining < I2S_BUF_WORDS ? remaining : I2S_BUF_WORDS;

    pcm_expand(next_tx, &pcm_audio_pcm[g_playback_pos], to_copy);
    g_playback_pos += to_copy;

    if (g_playback_pos >= PCM_NUM_SAMPLES) {
        if (g_playback_loop) {
            g_playback_pos = 0;
        } else {
            if (to_copy < I2S_BUF_WORDS) {
                memset(&next_tx[to_copy], 0,
                       (I2S_BUF_WORDS - to_copy) * sizeof(uint32_t));
            }
            nrfx_i2s_buffers_t next = {
                .p_tx_buffer = next_tx,
                .p_rx_buffer = next_rx,
                .buffer_size = I2S_BUF_WORDS,
            };
            nrfx_i2s_next_buffers_set(&g_i2s, &next);
            nrfx_i2s_stop(&g_i2s);
            return;
        }
    }

    if (to_copy < I2S_BUF_WORDS) {
        uint32_t wrap = I2S_BUF_WORDS - to_copy;
        pcm_expand(&next_tx[to_copy], &pcm_audio_pcm[0], wrap);
        g_playback_pos = wrap;
    }

    nrfx_i2s_buffers_t next = {
        .p_tx_buffer = next_tx,
        .p_rx_buffer = next_rx,
        .buffer_size = I2S_BUF_WORDS,
    };
    nrfx_i2s_next_buffers_set(&g_i2s, &next);
}

void board_i2s_playback_start(bool loop)
{
    if (g_i2s_running) return;

    g_playback_pos  = 0;
    g_playback_loop = loop;

    /* 预填充 TX 双缓冲, RX 清零 */
    pcm_expand(g_i2s_tx_a, &pcm_audio_pcm[0], I2S_BUF_WORDS);
    pcm_expand(g_i2s_tx_b, &pcm_audio_pcm[I2S_BUF_WORDS], I2S_BUF_WORDS);
    memset(g_i2s_rx_a, 0, I2S_BUF_WORDS * sizeof(uint32_t));
    memset(g_i2s_rx_b, 0, I2S_BUF_WORDS * sizeof(uint32_t));
    g_playback_pos = I2S_BUF_WORDS * 2;
    g_mic_write = 0;
    g_mic_read  = 0;

    nrfx_i2s_config_t cfg = NRFX_I2S_DEFAULT_CONFIG(
        I2S_SCK_PIN,
        I2S_LRCK_PIN,
        I2S_MCK_PIN,
        I2S_SDOUT_PIN,
        I2S_SDIN_PIN
    );
    cfg.sample_width = NRF_I2S_SWIDTH_16BIT;
    cfg.alignment    = NRF_I2S_ALIGN_LEFT;
    cfg.channels     = NRF_I2S_CHANNELS_STEREO;
    cfg.mck_setup    = NRF_I2S_MCK_32MDIV8;   /* MCK = 32M/8 = 4 MHz (整除) */
    cfg.ratio        = NRF_I2S_RATIO_256X;    /* LRCK = 4M/256 = 15.625 kHz (整除) */
    cfg.irq_priority = 6;

    nrfx_err_t err = nrfx_i2s_init(&g_i2s, &cfg, i2s_playback_data_handler);
    if (err != NRFX_SUCCESS) {
        rt_kprintf("I2S playback init failed: %u\n", (unsigned)err);
        return;
    }

