Retuze/nrf54l15/boards/xiao_nrf54l15/board.c
    nrfx_i2s_buffers_t initial = {
        .p_tx_buffer = g_i2s_tx_a,
        .p_rx_buffer = g_i2s_rx_a,
        .buffer_size = I2S_BUF_WORDS,
    };
    err = nrfx_i2s_start(&g_i2s, &initial, 0);
    if (err != NRFX_SUCCESS) {
        rt_kprintf("I2S playback start failed: %u\n", (unsigned)err);
        return;
    }

    g_i2s_running = true;
    rt_kprintf("I2S PCM playback started: 15.625kHz stereo, %u ms%s\n",
               (unsigned)PCM_DURATION_MS, loop ? ", looping" : "");
    rt_kprintf("  Connect D2(SDOUT) to your I2S DAC/amp\n");
}

void board_i2s_playback_toggle(void)
{
    if (g_i2s_running) {
        board_i2s_stop();
        rt_kprintf("Playback stopped by user\n");
    } else {
        board_i2s_playback_start(true);
    }
}

uint32_t board_i2s_mic_read(int16_t *buf, uint32_t max_samples)
{
    uint32_t r = g_mic_read;
    uint32_t w = g_mic_write;
    uint32_t avail;

    if (w >= r) {
        avail = w - r;
    } else {
        avail = MIC_BUF_SAMPLES - r + w;
    }

    uint32_t n = avail < max_samples ? avail : max_samples;
    for (uint32_t i = 0; i < n; i++) {
        buf[i] = g_mic_buf[r];
        r++;
        if (r >= MIC_BUF_SAMPLES) r = 0;
    }
    g_mic_read = r;
    return n;
}

/* ---- 电池电压测量 (SAADC, P1.13, TPS22916 开关 P1.14) ---------------- */

/*
 * 电路: 电池 → TPS22916 (P1.14 使能) → 1:2 分压 (1M+1M) → P1.13 (ADC).
 * 采集流程: P1.14 HIGH → 延时稳定 → SAADC 采样 (阻塞, <1ms) → P1.14 LOW.
 *
 * SAADC: 单端, 增益 1/3, 内部 1.024V 参考, 14-bit, 256x 过采样 (最高精度).
 * 量程: 0 ~ 3.072V (引脚) → 0 ~ 6.144V (电池).
 * 14-bit 单次范围 0..16383, 256x 过采样累加后 ≈ 0..4194303.
 *
 * 滑动窗口: 8 个样本取平均, 软件定时器 ~1s 周期.
 */
#define BAT_WINDOW_SIZE   8
#define BAT_GAIN_VAL      (1.0f / 3.0f)
#define BAT_VREF          1.024f
#define BAT_ADC_BITS      14
#define BAT_OVERSAMPLE    256
#define BAT_DIVIDER       2.0f

#define BAT_RES_MAX  ((1u << BAT_ADC_BITS) - 1)  /* 16383, 过采样不改变输出范围 */
#define BAT_MV_PER_LSB (BAT_VREF / BAT_GAIN_VAL / (float)(BAT_RES_MAX + 1) \
                        * BAT_DIVIDER * 1000.0f)  /* ≈ 0.375 mV/LSB */

static uint16_t g_bat_window[BAT_WINDOW_SIZE];
static uint8_t  g_bat_idx;
static uint8_t  g_bat_count;
static int      g_bat_mv;

/* 执行一次电池采集 + 滑窗 + 打印. 由 app 线程周期性调用. */
void board_battery_sample(void)
{
    static uint16_t sample;
    static bool     saadc_inited;

    if (!saadc_inited) {
        nrfx_err_t err = nrfx_saadc_init(NRFX_SAADC_DEFAULT_CONFIG_IRQ_PRIORITY);
        if (err != NRFX_SUCCESS && err != NRFX_ERROR_ALREADY) {
            rt_kprintf("[BAT] saadc init failed: %u\n", (unsigned)err);
            return;
        }

        nrfx_saadc_channel_t ch = {
            .channel_config = {
                .gain      = NRF_SAADC_GAIN1_3,
                .reference = NRF_SAADC_REFERENCE_INTERNAL,
#if NRF_SAADC_HAS_ACQTIME_ENUM
                .acq_time  = NRF_SAADC_ACQTIME_40US,
#else
                .acq_time  = 200,
#endif
                .mode      = NRF_SAADC_MODE_SINGLE_ENDED,
                .burst     = NRF_SAADC_BURST_DISABLED,
            },
            .pin_p         = BAT_ADC_PIN,
            .pin_n         = NRF_SAADC_INPUT_DISABLED,
            .channel_index = 0,
        };
        nrf_gpio_cfg_output(BAT_EN_PIN);
        nrf_gpio_pin_write(BAT_EN_PIN, 0);

        err = nrfx_saadc_channel_config(&ch);
        if (err != NRFX_SUCCESS) {
            rt_kprintf("[BAT] channel config failed: %u\n", (unsigned)err);
            return;
        }

        err = nrfx_saadc_simple_mode_set(1u << 0,
            NRF_SAADC_RESOLUTION_14BIT, NRF_SAADC_OVERSAMPLE_256X, NULL);
        if (err != NRFX_SUCCESS) {
            rt_kprintf("[BAT] simple_mode_set failed: %u\n", (unsigned)err);
            return;
        }

        saadc_inited = true;
    }

    /* 使能 TPS22916, 等稳定 */
    nrf_gpio_pin_write(BAT_EN_PIN, 1);
    for (volatile int i = 0; i < 200; i++) {}

    /* 阻塞采集: 过采样后只产生 1 个结果 */
    nrfx_saadc_buffer_set((nrf_saadc_value_t *)&sample, 1);
    nrfx_saadc_mode_trigger();

    /* 关断开关, 省电 */
    nrf_gpio_pin_write(BAT_EN_PIN, 0);

    uint16_t single = sample;

    /* 滑动窗口 */
    g_bat_window[g_bat_idx] = single;
    g_bat_idx = (g_bat_idx + 1) % BAT_WINDOW_SIZE;
    if (g_bat_count < BAT_WINDOW_SIZE) g_bat_count++;

    /* 窗口平均值 */
    uint32_t avg = 0;
    for (uint8_t i = 0; i < g_bat_count; i++) {
        avg += g_bat_window[i];
    }
    avg /= g_bat_count;
    g_bat_mv = (int)((float)avg * BAT_MV_PER_LSB + 0.5f);

    /* 打印 */
    rt_kprintf("[BAT] raw=0x%04X mv=%d avg_mv=%d (window=%u/%u)\n",
               (unsigned)single, (int)((float)single * BAT_MV_PER_LSB + 0.5f),
               g_bat_mv, (unsigned)g_bat_count, (unsigned)BAT_WINDOW_SIZE);
}

int board_battery_read_mv(void)
{
    return g_bat_mv;
}
